content/blog/episode_10.md
+++
title = "Episode 10: Obsession, small tweaks and Hyper key"
author = ["Rakhim Davletkaliyev"]
date = 2019-11-08T14:38:00+02:00
draft = false
creator = "Emacs 26.3 (Org mode 9.1.9 + ox-hugo)"
file_id = "ae621b11-c7de-4177-a819-0d51c3f65abc"
youtube_id = "Lil_4a1FVPg"
reddit_url = "https://old.reddit.com/r/emacs/comments/dtfqxz/emacscast_10_obsession_small_tweaks_and_hyper_key/"
+++

After a long break, let's get back into Emacs and talk about obsessions, small tweaks and improvements in my config, arrows and an additional modal key which could help with long, hard-to-remember Emacs key combinations.


## Shownotes {#shownotes}


### Intro {#intro}

-   [Dreaming of obsession](https://rakhim.org/2014/12/obsession/)
-   **[My new podcast about Computer science, programming and math](https://podcast.codexpanse.com/)**


### Config news {#config-news}

-   [Abbrev mode](https://www.gnu.org/software/emacs/manual/html%5Fnode/emacs/Abbrevs.html)
-   [YAsnippet](https://github.com/joaotavora/yasnippet)
-   [avy](https://github.com/abo-abo/avy)
-   [Episode 5: Blogging with Org mode and Emacs](https://emacscast.org/episode%5F5/)


### Hyper key {#hyper-key}

-   [Karabiner Elements](https://pqrs.org/osx/karabiner/)
-   [Configure a Hyper Key on OSX](https://www.nadeau.tv/post/configure-hyper-key-osx/)
-   [Karabiner God Mode](https://medium.com/@nikitavoloboev/karabiner-god-mode-7407a5ddc8f6)
